# BeforeSaveToCentral Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSaveToLocalProgressChangedEventArgs..::..BeforeSaveToCentral Property
DocumentSaveToLocalProgressChangedEventArgs Class See Also
---
True if the "save to local" operation is occurring before "save to central"; false if after.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public bool BeforeSaveToCentral { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BeforeSaveToCentral As Boolean
	Get
```

Visual C++
---
```text
public:
property bool BeforeSaveToCentral {
	bool get ();
}
```

# See Also
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace